Tekla Open API Reference for Tekla Structures 2025
PolyBeam.GetPolybeamCoordinateSystems Method
 Returns a list of coordinate systems for the polybeam segments.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList GetPolybeamCoordinateSystems()
Public Function GetPolybeamCoordinateSystems As ArrayList
Return Value
Type: ArrayList
A list of coordinate systems for the polybeam segments.
See Also
Reference
PolyBeam Class
Tekla.Structures.Model Namespace